{
  "version": "https://jsonfeed.org/version/1",
  "title": "Justin Palmer",
  "home_page_url": "https://jeplmr.com",
  "feed_url": "https://example.com/feed/feed.json",
  "description": "Justin Palmer - Portfolio and Blog for all things Game Dev and Level Design. Valve, plz dont sue me for using the Hammer logo as my favicon.",
  "author": {
    "name": "Justin Palmer",
    "url": "https://jeplmr.com/about-me/"
  },
  "items": [{
      "id": "https://jeplmr.com/posts/retroride/",
      "url": "https://jeplmr.com/posts/retroride/",
      "title": "Retro Ride",
      "content_html": "<p>Another Mapcore challenge. In August 2019, I couldn't pass up their 'Retro Ride' challenge. The rules were simple: Recreate the Ecto-1, the DeLorean time machine, or Jurassic Park Jeep. Oh, and it needs to be less than 500 tris and use a single 128*128 texture map. I adore all three of those vehicles, so I kitbashed them all together in a way I thought was fitting.</p>\n<div class=\"sketchfab-embed-wrapper\">\n    <iframe title=\"A 3D model\" width=\"1024\" height=\"768\" src=\"https://sketchfab.com/models/873d009b36a84b06a5e2612c8ecafa9d/embed?autostart=0&amp;ui_controls=1&amp;ui_infos=1&amp;ui_inspector=1&amp;ui_stop=1&amp;ui_watermark=1&amp;ui_watermark_link=1\" frameborder=\"0\" allow=\"autoplay; fullscreen; vr\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\"></iframe>\n    <p style=\"font-size: 13px; font-weight: normal; margin: 5px; color: #4A4A4A;\">\n        <a href=\"https://sketchfab.com/3d-models/delorean-873d009b36a84b06a5e2612c8ecafa9d?utm_medium=embed&utm_source=website&utm_campaign=share-popup\" target=\"_blank\" style=\"font-weight: bold; color: #1CAAD9;\">DeLorean</a>\n        by <a href=\"https://sketchfab.com/jeplmr?utm_medium=embed&utm_source=website&utm_campaign=share-popup\" target=\"_blank\" style=\"font-weight: bold; color: #1CAAD9;\">jeplmr</a>\n        on <a href=\"https://sketchfab.com?utm_medium=embed&utm_source=website&utm_campaign=share-popup\" target=\"_blank\" style=\"font-weight: bold; color: #1CAAD9;\">Sketchfab</a>\n    </p>\n</div>\n<p>Do me favor and don't look under the car. Or behind it.</br></br>;)</p>",
      "date_published": "2021-01-19T00:00:00+00:00"
    },{
      "id": "https://jeplmr.com/posts/nostalgiclevelup/",
      "url": "https://jeplmr.com/posts/nostalgiclevelup/",
      "title": "Nostalgic Level Up - Super Mario Bros. World 1-1",
      "content_html": "<p>I like to participate in Mapcore's monthly challenges whenever I get the chance. In July 2019, the challenge was to recreate a level from a video game. There was a choice of three maps, but only one stuck out to me. World 1-1 from Super Mario Bros. I took the whole month and recreated everything I could using Unity and Blender. I made all the textures, models, animations, programming. Everything from scratch. Except the music, that was done by the talented <a href=\"https://soundcloud.com/jonathan-marlin\" target=\"blank\">Jonathan Marlin</a>.</p>\n<div class=\"container\">\n<p style=\"text-align: center\"><iframe width=\"800\" height=\"600\" src=\"https://www.youtube.com/watch?v=jVVU7xRXGv4\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen class=\"video\"></iframe></p></div>",
      "date_published": "2021-01-19T00:00:00+00:00"
    },{
      "id": "https://jeplmr.com/posts/mend/",
      "url": "https://jeplmr.com/posts/mend/",
      "title": "Mend - Oculus Launch Pad 2019",
      "content_html": "<p>Mend is an asymmetric coop game where virtual reality and flatscreen gameplay coalesce. Two players must work together to solve puzzles and explore the world. I built the vertical slice of Mend for Oculus Launch Pad. The project even went on to win the <a href=\"https://www.oculus.com/blog/introducing-the-2019-oculus-launch-pad-scholarship-recipients-plus-2020-applications-now-open/\" target=\"blank\">2019 Launch Pad Scholarship</a>!</p>\n<div class=\"container\">\n<p style=\"text-align: center\"><iframe width=\"800\" height=\"600\" src=\"https://www.youtube.com/watch?v=CKeRf5Wvzjg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen class=\"video\"></iframe></p></div>",
      "date_published": "2021-01-19T00:00:00+00:00"
    },{
      "id": "https://jeplmr.com/posts/environmentstudy/",
      "url": "https://jeplmr.com/posts/environmentstudy/",
      "title": "Environment Study",
      "content_html": "<p>Late in December 2018, my local Unity meetup hosted a month-long environment study challenge. The rules were simple: recreate a scene from any photo. <a href=\"https://docs.google.com/presentation/d/1t72S2quB0F73HnqWhIXWOFzrJ5RDRX9qGtP3_yET5P8/edit?usp=sharing\" target=\"blank\">I detail my process here in these slides</a>, but the basic idea is that I took the specifications from the physical camera used to take the reference photo and applied them to the camera settings in Unity. Once I had that, I overlaid the reference photo on top of my scene in Unity and started rebuilding everything from scratch. Please excuse some of the messy geometry in the scene, I was still learning Blender at the time.</p>\n<div class=\"container\">\n<p style=\"text-align: center\"><iframe width=\"800\" height=\"600\" src=\"https://docs.google.com/presentation/d/1t72S2quB0F73HnqWhIXWOFzrJ5RDRX9qGtP3_yET5P8/edit?usp=sharing\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen class=\"video\"></iframe></p></div>",
      "date_published": "2021-01-19T00:00:00+00:00"
    },{
      "id": "https://jeplmr.com/posts/leveldesign/",
      "url": "https://jeplmr.com/posts/leveldesign/",
      "title": "Ramblings on Level Design, Part 1",
      "content_html": "<p>Buckle up, we're going back to 2002.</p>\n<p style=\"text-indent: 2em\">I think I got my first \"look behind the curtain\" with <i>Return to Castle Wolfenstein</i>. My brother brought home a \"Game of the Year\" edition of the game, which was really cool because it came with a bunch of extras like desktop wallpapers and such. But the coolest extra was a developer highlight reel, which I've linked below. I must have watched that reel at least a dozen times back in the day. I definitely wasn't old enough for the game's <i>M for Mature</i> rating at the time, so seeing the people and the creative process captured the full attention of my young, <i>E for Everyone</i> mind. I had only ever known video games as these weird black boxes that suddenly made your TV interactive. I never stopped to think about how those black boxes were made. But seeing the developers talk about how they made the magic happen was incredibly fascinating, especially for my 13-ish year old self. I especially love what Rich Farrelly said about the level editor; \"It can be pretty intimidating at first with all the lines, entities, verticies... and any other -ies you can think of\".\n<div class=\"container\">\n<p style=\"text-align: center\"><iframe width=\"800\" height=\"600\" src=\"https://www.youtube.com/embed/BC_KoTZbRQA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen class=\"video\"></iframe></p></div>\n<p style=\"text-indent: 2em\">A couple years later, and a small indie game called <i>Half-Life 2</i> releases in 2004. You've probably never heard of it. But Half-Life 2 was great. Played through single player a bunch. Hurled toilets at other people in HL2 Deathmatch. Loved it. But then I found the modding scene. And, for better or worse, Garry's mod. And it was playing gmod where I found other normal people (i.e., kids just like me) making and sharing content for a video game. It definitely helped break down this \"I could never do that\" mindset I was stuck with. I eventually joined the Facepunch forums, got banned a bunch for bad grammar, but <i>then</i> I started looking around the \"mapping\" threads. And this is where I downloaded Hammer and took a whack at making my own Garry's Mod maps for the first time. \n<p style=\"text-indent: 2em\">Boy oh boy, were they bad. Plus I had no idea what I was doing (then again, I don't think anyone else on the Facepunch mapping forums did, either). But it didn't matter. I had a blast making my awful maps. I also met a bunch of really cool people that I otherwise wouldn't have. I made malls, zombie infested towns, remakes, catacombs. I made whatever my highschool brain (and limited free time) could think up. My friends and I even tried tackling a full-sized Half-Life 2 mod about a Civil Protection cop caught in the crossfire of Gordon's misadventures. We never finished the mod, unfortunately. But hey, at least a few scrappy highschool kids scattered across the country were willing to even try a project with that scope. We made a surprising amount of progress before SATs, ACTs, and college prep got in the way. Here are some really low resolution screenshots I managed to scrounge up! \n<p style=\"text-align: center\"><i>Some catacombs I was working on.</i><br><img src=\"/img/catacombs.jpg\"><p>\n<p style=\"text-align: center\"><i>rp_zombiesurvival, one of my more popular Garry's Mod maps.</i><br><img src=\"/img/zs1.jpg\"></p>\n<p style=\"text-align: center\"><i>An unfinished shopping mall. Yes, I was going to fill this with zombies, too.</i><br><img src=\"/img/mall.jpg\"></p>\n<p style=\"text-align: center\"><i>A remake of Mario Kart 64's Blockfort, featuring custom textures.</i><br><img src=\"/img/blockfort.jpg\"></p>\n<p style=\"text-align: center\"><i>An introductory level of the aforementioned HL2 mod that was never finished.</i><br><img src=\"/img/combinemod.jpg\"></p>\n<p><i>~ Let's do the time warp again ~</i></p>\n<p style=\"text-indent: 2em\">The year is 2015. Corona is only just a beer. I had recently graduated college a few years prior with a \"real\" degree and landed a \"real\" job doing \"real\" work. I had also dropped any kind of game dev or level design as a hobby. And I was honestly pretty miserable. A friend of mine, Jonathan Schrack, introduced me to a local Unity usergroup in town. I'm grateful glad he did, because it woke up this long dormant love I used to have for making stuff. I started showing up to the meetups, I learned the basics of the Unity engine, I learned how to script gameplay with C#, and I participated in <i>a lot</i> of game jams. I even learned how to use Blender to make custom models and characters somewhat proficiently. One of my jam games even won <a href=\"https://ldjam.com/events/ludum-dare/41/modern-art-critic-hero\" target=\"blank\">4th place for Humor</a> in Ludum Dare 41!\n<p style=\"text-indent: 2em\">One year later, Jonathan brought me onto a small team working on a VR beat-em-up called <i>Kung Fu: Shadow Fist</i>. Think <i>Streets of Rage</i>, but in VR. My job was to design levels for the game (shocking, I know). The mechanics of KFSF were pretty simple; You could teleport to predetermined locations to navigate through the world, throw punches with the motion controllers, and use a charged ability called Shadow Strike, which would slow down time and cause your punches to do extra damage. The vertical slice was pretty great, considering the dev team was a fairly ragtag bunch of three part-time developers.</p>\n<p style=\"text-indent: 2em\">Adapting the level design of those classic beat-em-ups ended up being pretty challenging. The levels in those games were linear, usually forcing the player to move left-to-right across the screen. This shifted my focus to creating memorable events instead of creating more elaborate, open designs. For example, \"The Subway Level\" didn't take place <i>just</i> in a subway. The player started the city streets, beating up gang members until they arrived at a bar. Inside the bar were more thugs. Taking them out rewarded the player with a bathroom gag, in which one lone bonehead would exit the restroom in a, hopefully, amusing display of Vincent-Vega-style bad timing. After the bar, the player would finally make their way to the subway, and board a train. This resulted in a climactic battle between the player and the rival gang, all while the train was en route to its destination.</p>\n<p style=\"text-align: center\"><i>An early blockout of \"The Subway Level\" featured in <i>Kung Fu: Shadow Fist's vertical slice.</i><br><img src=\"/img/kfsf.jpg\" class=\"center\"></i></p>\n<p style=\"text-align: center\"><i>A top-down view of the entire vertical slice level.</i><br><img src=\"/img/kfsf_topdown.png\" class=\"center\"></p>\n<p style=\"text-align: center\"><i>A simple vista featuring lighting from police sirens and placeholder art.</i><br><img src=\"/img/kfsf_police.gif\" class=\"center\"></p>\n<p style=\"text-align: center\"><i>A shot of a city street, featuring an extremely punchable NPC. Now that's a face only a mother could love.</i><br><img src=\"/img/kfsf_street.png\" class=\"center\"></p>\n<div class=\"container\">\n<p style=\"text-align: center\"><i>\"The Subway Level\" train ride. I put together this simple illusion where the tunnel moves around an immobile train car.</i><br>\n<iframe width=\"800\" height=\"600\" src=\"https://www.youtube.com/embed/M-fQaoTNNPk\" frameborder=\"0\" allow=\"accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen class=\"video\"></iframe></p></div>\n<p style=\"text-indent: 2em\">Making this level for KFSF was really fun. But there was something about the level I just couldn't get into. I never really found an identity for it. A feel. I never got into a flow state while working on it. And I think it shows. While I'm really proud of the various events I put together in the level, the space itself feels very.. uninspired. It's basically a long hallway that extends from the city streets to the end of the train station. There are no branching paths, the player isn't presented with interesting choices, and the gameplay gets repetitive very quickly. Don't get me wrong, I don't think the level was that bad. But it certainly wasn't that good, either. I will say that it was a competent vertical slice demo, and looking back at it, I'm proud as hell at what I helped build.<p>\n<p style=\"text-indent: 2em\">Do you ever find yourself reading something and it reaches out and slaps you across the face? Well, I did. I was reading through <i>101 Things I learned in Architecture School</i> at the recommendation of, well, a whole bunch of people. And this page stuck with me:</p>\n<p style=\"background-color: #000000; font-family: serif\">\n<b>Architecture begins with an idea.</b><br><br>\nGood design solutions are not merely physically interesting but are driven by underlying ideas. An idea is a specific mental structre by which we organize, understand, and give meaning to external experiences and information. Without underlying ideas informing their buildings, architects are merely space planners. Space planning with decoration applied to 'dress it up' is not architecture; architecture resides in the DNA of a building, in an embedded sensibility that infuses its whole.\n<br><br>\n101 Things I learned in Architecture School<br>Matthew Frederick</p>\n<p style=\"text-indent: 2em\">This one page managed to sum up a bunch of things I was unknowingly doing wrong. I would too quickly jump into making my levels look like the places I wanted them to be, instead of building gameplay spaces that take advantage of a game's mechanics. I want to say I picked this habit up in my Garry's Mod days. Because that mod was so aimless and sandboxy, there were no gameplay mechanics to undertsand, no goals to reach. Which isn't a bad thing, it's just a nature-of-the-beast thing when it comes to gmod. Because I was always so focused on <i>how</i> I built a wall, I never practiced building focused gameplay spaces; i.e., I never thought about if the wall should even be there in the first place.</p>\n<p style=\"text-align: center\"><img src=\"/img/scottpilgrim.gif\"></p>\n<p><i>In part 2, I'll talk about what I'm working on currently, and how I've been working to improve my level design skills in the last couple years.</i></p>\n<p><i>To be continued...</i></p>",
      "date_published": "2020-12-29T00:00:00+00:00"
    },{
      "id": "https://jeplmr.com/posts/mach/",
      "url": "https://jeplmr.com/posts/mach/",
      "title": "Modern Art Critic Hero",
      "content_html": "<p>\n<a href=\"https://jeplmr.itch.io/modern-art-critic-hero\" target=\"blank\"><img src=\"/img/MACH.png\"></a>\n</p>\n<p>\n<a href=\"https://jeplmr.itch.io/modern-art-critic-hero\" target=\"blank\">Modern Art Critic Hero</a> is a microgame based on the theme 'Combine Two Incompatible Genres'. Play as <i>The Critic</i> on their personal journey to critique as much modern art as they can. Explore the museum and contemplate life, existence, and the exhibits.</p>\n<p>\nModern Art Critic Hero won <a href=\"https://ldjam.com/events/ludum-dare/41/modern-art-critic-hero\" target=\"blank\">4th place for Humor</a> in Ludum Dare 41. \n</P>",
      "date_published": "2020-12-23T00:00:00+00:00"
    },{
      "id": "https://jeplmr.com/posts/twh/",
      "url": "https://jeplmr.com/posts/twh/",
      "title": "The Witching Hour",
      "content_html": "<p>\n<a href=\"https://memphis-game-developers.itch.io/the-witching-hour\" target=\"blank\"><img src=\"/img/whss.jpg\"></a>\n</p>\n<p>\n<a href=\"https://memphis-game-developers.itch.io/the-witching-hour\" target=\"blank\">The Witching Hour</a> is a horror microgame created in 48 hours at Global Game Jam 2018. The jam theme was Transmission. The player must keep possessed appliances quiet, or suffer the wrath of an evil spirit that haunts the house.\n</P>\n",
      "date_published": "2020-12-22T00:00:00+00:00"
    },{
      "id": "https://jeplmr.com/posts/second/",
      "url": "https://jeplmr.com/posts/second/",
      "title": "Update time!",
      "content_html": "<p>Oh, how time flies when you're having fun. I haven't updated this place in about a month! Time to fix that.</p>\n<p>More soon!</p>\n",
      "date_published": "2020-12-22T00:00:00+00:00"
    },{
      "id": "https://jeplmr.com/posts/first/",
      "url": "https://jeplmr.com/posts/first/",
      "title": "Pardon the dust...",
      "content_html": "<p>You'll have to forgive me, I decided to rework my portfolio/blog from scratch. I was running static HTML/CSS on an Amazon S3 bucket, and finally decided it was high time to do things &quot;the right way&quot;. This site utilizes 11ty as a statc content generator, and I'm using GitHub and TravisCI for version control, hosting, and CI/CD.</p>\n<p>I probably should have learned how to properly use all these tools first before taking my old portfolio down. Whoops! #MVP</p>\n<p>Anyway, please excuse the dust around here. I haven't stretched my web design skills in a hot minute. I've been laser focused on Unity Development and Level Design lately.</p>\n",
      "date_published": "2020-11-24T00:00:00+00:00"
    }
  ]
}
